/**
 * Уметь сортировать массивы.
 * public class Высший_регистр.
 * public static void низший_регистр.
 * p+s+v+m+Tab=public static void main(String[] args) {}.
 * Алгоритм - это конкр. посл. шагов кот. исп. для решения.
 * Метод - это место где будет находиться [мой] алгоритм.
 * Переменная - это символ, который обозначает число.
 * Тип определяет значение, которое может принять переменная.
 * Все красное - это ошибки, которые появляется до запуска программы.
 * Простые типы - скалярные.
 * Массив - упорядоченная последовательность чисел.
 * Вывести массив можно только по-этапно.
 * "Массивы":
 * Действие_1- Создание;
 * Действие_2- Вывод елемента;
 * Действие_3- Присвоить ячейке другое значение;
 * Действие_4- Обобщать значение ячеек (присв.).
 * Размер массива фиксирован.
 * Цикл предназначен для того, чтобы перебирать елементы массыва автоматически.
 */
public class C001 {

    public static void main(String[] args) {
        int a = 3;
        int some = 5;
        double d = 4.34;
        System.out.println(some);
        some = 10;
        System.out.println(some);
    }

}
/*
Д/з:
1. Посмотреть видеоуроки;
2. Какие бывают типы данных(8 шт.)[int, long, short, double, float...];
3. Арифмеические операции;
4. Массивы.
 */
